
eventEmitter.addEventListener("body_refreshed", () => about_refresh());
eventEmitter.addEventListener("menu_refreshed", () => about_refresh());


function about_refresh() {

  if (typeof aboutContainer === 'undefined')
    return;

  if (menu_obj.current != "about") {
    aboutContainer.innerHTML = "";
  } else {
    about_innerRefresh();
  }

  eventEmitter.dispatchEvent(new Event("about_refreshed"));
}

function about_innerRefresh() {

  const achievements = about_renderCard(
    "Достижения",
    `Есть много вариантов Lorem Ipsum, но большинство из них имеет не всегда приемлемые модификации, например, юмористические вставки или
     слова, которые даже отдалённо не напоминают латынь. Если вам нужен Lorem Ipsum для серьёзного проекта, вы наверняка не хотите
     какой-нибудь шутки, скрытой в середине абзаца. Также все другие известные генераторы Lorem Ipsum используют один и тот же текст,
     который они просто повторяют, пока не достигнут нужный объём. Это делает предлагаемый здесь генератор единственным настоящим Lorem Ipsum
     генератором. Он использует словарь из более чем 200 латинских слов, а также набор моделей предложений. В результате сгенерированный Lorem
     Ipsum выглядит правдоподобно, не имеет повторяющихся абзацей или "невозможных" слов.`);

  const experience = about_renderCard(
    "Навыки",
    `Многие думают, что Lorem Ipsum - взятый с потолка псевдо-латинский набор слов, но это не совсем так. Его корни уходят в один фрагмент
     классической латыни 45 года н.э., то есть более двух тысячелетий назад. Ричард МакКлинток, профессор латыни из колледжа Hampden-Sydney,
     штат Вирджиния, взял одно из самых странных слов в Lorem Ipsum, "consectetur", и занялся его поисками в классической латинской литературе.
     В результате он нашёл неоспоримый первоисточник Lorem Ipsum в разделах 1.10.32 и 1.10.33 книги "de Finibus Bonorum et Malorum" ("О пределах
     добра и зла"), написанной Цицероном в 45 году н.э. Этот трактат по теории этики был очень популярен в эпоху Возрождения. Первая строка
     Lorem Ipsum, "Lorem ipsum dolor sit amet..", происходит от одной из строк в разделе 1.10.32.`);

  const education = about_renderCard(
    "Квалификация",
    `Давно выяснено, что при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum используют потому, что тот
     обеспечивает более или менее стандартное заполнение шаблона, а также реальное распределение букв и пробелов в абзацах, которое не
     получается при простой дубликации "Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст.." Многие программы электронной вёрстки и редакторы
     HTML используют Lorem Ipsum в качестве текста по умолчанию, так что поиск по ключевым словам "lorem ipsum" сразу показывает, как много веб-страниц
     всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem Ipsum получил много версий. Некоторые версии появились по ошибке,
     некоторые - намеренно (например, юмористические варианты).`);

  aboutContainer.innerHTML = `
    <div class="flex flex-wrap font-sans font-medium leading-normal">      
      ${achievements}
      ${experience}
      ${education}
    </div>
  `;

}

function about_renderCard(caption, text) {
  return `
    <div class="flex flex-col p-10 w-full md:w-1/3">
      <div class="text-lg py-4">${caption}</div>
      <div class="text-sm lg:text-base">${text}</div>
    </div>
  `;
}